Mr-Bossman/linux/include/dt-bindings/pinctrl/pins-imxrt1050.h
/* SPDX-License-Identifier: GPL-2.0+ */
/*
 * Copyright (C) 2020
 * Author(s): Giulio Benetti <giulio.benetti@benettiengineering.com>
 */

#ifndef _DT_BINDINGS_PINCTRL_IMXRT1050_PINFUNC_H
#define _DT_BINDINGS_PINCTRL_IMXRT1050_PINFUNC_H

#define IMX_PAD_SION	(0x40000000)

/*
 * The pin function ID is a tuple of
 * <mux_reg conf_reg input_reg mux_mode input_val>
 */

#define MXRT1050_IOMUXC_GPIO_EMC_00_SEMC_DA00				(0x014 0x204 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_00_FLEXPWM4_PWM0_A			(0x014 0x204 0x494 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_00_LPSPI2_SCK				(0x014 0x204 0x500 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_00_XBAR_INOUT2				(0x014 0x204 0x60C 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_00_FLEXIO1_D00				(0x014 0x204 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_00_GPIO4_IO00				(0x014 0x204 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_01_SEMC_DA01				(0x018 0x208 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_01_FLEXPWM4_PWM0_B			(0x018 0x208 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_01_LPSPI2_PCS0				(0x018 0x208 0x4FC 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_01_XBAR_INOUT3				(0x018 0x208 0x610 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_01_FLEXIO1_D01				(0x018 0x208 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_01_GPIO4_IO01				(0x018 0x208 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_02_SEMC_DA02				(0x01C 0x20C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_02_FLEXPWM4_PWM1_A			(0x01C 0x20C 0x498 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_02_LPSPI2_SDO				(0x01C 0x20C 0x508 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_02_XBAR_INOUT4				(0x01C 0x20C 0x614 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_02_FLEXIO1_D02				(0x01C 0x20C 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_02_GPIO4_IO02				(0x01C 0x20C 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_03_SEMC_DA03				(0x020 0x210 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_03_FLEXPWM4_PWM1_B			(0x020 0x210 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_03_LPSPI2_SDI				(0x020 0x210 0x504 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_03_XBAR_INOUT5				(0x020 0x210 0x618 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_03_FLEXIO1_D03				(0x020 0x210 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_03_GPIO4_IO03				(0x020 0x210 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_04_SEMC_DA04				(0x024 0x214 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_04_FLEXPWM4_PWM2_A			(0x024 0x214 0x49C 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_04_SAI2_TX_DATA			(0x024 0x214 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_04_XBAR_INOUT6				(0x024 0x214 0x61C 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_04_FLEXIO1_D04				(0x024 0x214 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_04_GPIO4_IO04				(0x024 0x214 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_05_SEMC_DA05				(0x028 0x218 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_05_FLEXPWM4_PWM2_B			(0x028 0x218 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_05_SAI2_TX_SYNC			(0x028 0x218 0x5C4 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_05_XBAR_INOUT7				(0x028 0x218 0x620 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_05_FLEXIO1_D05				(0x028 0x218 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_05_GPIO4_IO05				(0x028 0x218 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_06_SEMC_DA06				(0x02C 0x21C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_06_FLEXPWM2_PWM0_A			(0x02C 0x21C 0x478 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_06_SAI2_TX_BCLK			(0x02C 0x21C 0x5C0 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_06_XBAR_INOUT8				(0x02C 0x21C 0x624 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_06_FLEXIO1_D06				(0x02C 0x21C 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_06_GPIO4_IO06				(0x02C 0x21C 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_07_SEMC_DA07				(0x030 0x220 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_07_FLEXPWM2_PWM0_B			(0x030 0x220 0x488 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_07_SAI2_MCLK				(0x030 0x220 0x5B0 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_07_XBAR_INOUT9				(0x030 0x220 0x628 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_07_FLEXIO1_D07				(0x030 0x220 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_07_GPIO4_IO07				(0x030 0x220 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_08_SEMC_DM00				(0x034 0x224 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_08_FLEXPWM2_PWM1_A			(0x034 0x224 0x47C 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_08_SAI2_RX_DATA			(0x034 0x224 0x5B8 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_08_XBAR_INOUT17			(0x034 0x224 0x62C 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_08_FLEXIO1_D08				(0x034 0x224 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_08_GPIO4_IO08				(0x034 0x224 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_09_SEMC_ADDR00				(0x038 0x228 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_09_FLEXPWM2_PWM1_B			(0x038 0x228 0x48C 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_09_SAI2_RX_SYNC			(0x038 0x228 0x5BC 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_09_FLEXCAN2_TX				(0x038 0x228 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_09_FLEXIO1_D09				(0x038 0x228 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_09_GPIO4_IO09				(0x038 0x228 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_10_SEMC_ADDR01				(0x03C 0x22C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_10_FLEXPWM2_PWM2_A			(0x03C 0x22C 0x480 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_10_SAI2_RX_BCLK			(0x03C 0x22C 0x5B4 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_10_FLEXCAN2_RX				(0x03C 0x22C 0x450 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_10_FLEXIO1_D10				(0x03C 0x22C 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_10_GPIO4_IO10				(0x03C 0x22C 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_11_SEMC_ADDR02				(0x040 0x230 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_11_FLEXPWM2_PWM2_B			(0x040 0x230 0x490 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_11_LPI2C4_SDA				(0x040 0x230 0x4E8 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_11_USDHC2_RESET_B			(0x040 0x230 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_11_FLEXIO1_D11				(0x040 0x230 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_11_GPIO4_IO11				(0x040 0x230 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_12_SEMC_ADDR03				(0x044 0x234 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_12_XBAR_INOUT24			(0x044 0x234 0x640 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_12_LPI2C4_SCL				(0x044 0x234 0x4E4 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_12_USDHC2_WP				(0x044 0x234 0x5D8 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_12_FLEXPWM1_PWM3_A			(0x044 0x234 0x454 0x4 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_12_GPIO4_IO12				(0x044 0x234 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_13_SEMC_ADDR04				(0x048 0x238 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_13_XBAR_INOUT25			(0x048 0x238 0x650 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_13_LPUART3_TXD				(0x048 0x238 0x53C 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_13_MQS_RIGHT				(0x048 0x238 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_13_FLEXPWM1_PWM3_B			(0x048 0x238 0x464 0x4 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_13_GPIO4_IO13				(0x048 0x238 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_14_SEMC_ADDR05				(0x04C 0x23C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_14_XBAR_INOUT19			(0x04C 0x23C 0x654 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_14_LPUART3_RXD				(0x04C 0x23C 0x538 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_14_MQS_LEFT				(0x04C 0x23C 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_14_LPSPI2_PCS1				(0x04C 0x23C 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_14_GPIO4_IO14				(0x04C 0x23C 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_15_SEMC_ADDR06				(0x050 0x240 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_15_XBAR_INOUT20			(0x050 0x240 0x634 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_15_LPUART3_CTS_B			(0x050 0x240 0x534 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_15_SPDIF_OUT				(0x050 0x240 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_15_TMR3_TIMER0				(0x050 0x240 0x57C 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_15_GPIO4_IO15				(0x050 0x240 0x000 0x5 0x0)

