Mr-Bossman/linux/include/dt-bindings/pinctrl/pins-imxrt1050.h
#define MXRT1050_IOMUXC_GPIO_EMC_16_SEMC_ADDR07				(0x054 0x244 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_16_XBAR_INOUT21			(0x054 0x244 0x658 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_16_LPUART3_RTS_B			(0x054 0x244 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_16_SPDIF_IN				(0x054 0x244 0x5C8 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_16_TMR3_TIMER1				(0x054 0x244 0x580 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_16_GPIO4_IO16				(0x054 0x244 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_17_SEMC_ADDR08				(0x058 0x248 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_17_FLEXPWM4_PWM3_A			(0x058 0x248 0x4A0 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_17_LPUART4_CTS_B			(0x058 0x248 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_17_FLEXCAN1_TX				(0x058 0x248 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_17_TMR3_TIMER2				(0x058 0x248 0x584 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_17_GPIO4_IO17				(0x058 0x248 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_18_SEMC_ADDR09				(0x05C 0x24C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_18_FLEXPWM4_PWM3_B			(0x05C 0x24C 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_18_LPUART4_RTS_B			(0x05C 0x24C 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_18_FLEXCAN1_RX				(0x05C 0x24C 0x44C 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_18_TMR3_TIMER3				(0x05C 0x24C 0x588 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_18_GPIO4_IO18				(0x05C 0x24C 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_18_SNVS_VIO_5_CTL			(0x05C 0x24C 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_19_SEMC_ADDR11				(0x060 0x250 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_19_FLEXPWM2_PWM3_A			(0x060 0x250 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_19_LPUART4_TXD				(0x060 0x250 0x544 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_19_ENET_RX_DATA01			(0x060 0x250 0x438 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_19_TMR2_TIMER0				(0x060 0x250 0x56C 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_19_GPIO4_IO19				(0x060 0x250 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_19_SNVS_VIO_5				(0x060 0x250 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_20_SEMC_ADDR12				(0x064 0x254 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_20_FLEXPWM2_PWM3_B			(0x064 0x254 0x484 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_20_LPUART4_RXD				(0x064 0x254 0x540 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_20_ENET_RX_DATA00			(0x064 0x254 0x434 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_20_TMR2_TIMER0				(0x064 0x254 0x570 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_20_GPIO4_IO20				(0x064 0x254 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_21_SEMC_BA0				(0x068 0x258 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_21_FLEXPWM3_PWM3_A			(0x068 0x258 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_21_LPI2C3_SDA				(0x068 0x258 0x4E0 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_21_ENET_TX_DATA01			(0x068 0x258 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_21_TMR2_TIMER2				(0x068 0x258 0x574 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_21_GPIO4_IO21				(0x068 0x258 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_22_SEMC_BA1				(0x06C 0x25C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_22_FLEXPWM3_PWM3_B			(0x06C 0x25C 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_22_LPI2C3_SCL				(0x06C 0x25C 0x4DC 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_22_ENET_TX_DATA00			(0x06C 0x25C 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_22_TMR2_TIMER3				(0x06C 0x25C 0x578 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_22_GPIO4_IO22				(0x06C 0x25C 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_23_SEMC_ADDR10				(0x070 0x260 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_23_FLEXPWM1_PWM0_A			(0x070 0x260 0x458 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_23_LPUART5_TXD				(0x070 0x260 0x54C 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_23_ENET_RX_EN				(0x070 0x260 0x43C 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_23_GPT1_CAPTURE2			(0x070 0x260 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_23_GPIO4_IO23				(0x070 0x260 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_24_SEMC_CAS				(0x074 0x264 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_24_FLEXPWM1_PWM0_B			(0x074 0x264 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_24_LPUART5_RXD				(0x074 0x264 0x548 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_24_ENET_TX_EN				(0x074 0x264 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_24_GPT1_CAPTURE1			(0x074 0x264 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_24_GPIO4_IO24				(0x074 0x264 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_25_SEMC_RAS				(0x078 0x268 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_25_FLEXPWM1_PWM1_A			(0x078 0x268 0x45C 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_25_LPUART6_TXD				(0x078 0x268 0x554 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_25_ENET_TX_CLK				(0x078 0x268 0x448 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_25_ENET_REF_CLK			(0x078 0x268 0x42C 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_25_GPIO4_IO25				(0x078 0x268 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_26_SEMC_CLK				(0x07C 0x26C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_26_FLEXPWM1_PWM1_B			(0x07C 0x26C 0x46C 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_26_LPUART6_RXD				(0x07C 0x26C 0x550 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_26_ENET_RX_ER				(0x07C 0x26C 0x440 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_26_FLEXIO1_D12				(0x07C 0x26C 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_26_GPIO4_IO26				(0x07C 0x26C 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_27_SEMC_CKE				(0x080 0x270 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_27_FLEXPWM1_PWM2_A			(0x080 0x270 0x460 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_27_LPUART5_RTS_B			(0x080 0x270 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_27_LPSPI1_SCK				(0x080 0x270 0x4F0 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_27_FLEXIO1_D13				(0x080 0x270 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_27_GPIO4_IO27				(0x080 0x270 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_28_SEMC_WE				(0x084 0x274 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_28_FLEXPWM1_PWM2_B			(0x084 0x274 0x470 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_28_LPUART5_CTS_B			(0x084 0x274 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_28_LPSPI1_SDO				(0x084 0x274 0x4F8 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_28_FLEXIO1_D14				(0x084 0x274 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_28_GPIO4_IO28				(0x084 0x274 0x000 0x5 0x0)

