Mr-Bossman/linux/include/dt-bindings/pinctrl/pins-imxrt1050.h
#define MXRT1050_IOMUXC_GPIO_EMC_29_SEMC_CS0				(0x088 0x278 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_29_FLEXPWM3_PWM0_A			(0x088 0x278 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_29_LPUART6_RTS_B			(0x088 0x278 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_29_LPSPI1_SDI				(0x088 0x278 0x4F4 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_29_FLEXIO1_D15				(0x088 0x278 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_29_GPIO4_IO29				(0x088 0x278 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_30_SEMC_DA08				(0x08C 0x27C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_30_FLEXPWM3_PWM0_B			(0x08C 0x27C 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_30_LPUART6_CTS_B			(0x08C 0x27C 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_30_LPSPI1_PCS0				(0x08C 0x27C 0x4EC 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_30_CSI_DATA23				(0x08C 0x27C 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_30_GPIO4_IO30				(0x08C 0x27C 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_31_SEMC_DA09				(0x090 0x280 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_31_FLEXPWM3_PWM1_A			(0x090 0x280 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_31_LPUART7_TXD				(0x090 0x280 0x55C 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_31_LPSPI1_PCS1				(0x090 0x280 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_31_CSI_DATA22				(0x090 0x280 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_31_GPIO4_IO31				(0x090 0x280 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_32_SEMC_DA10				(0x094 0x284 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_32_FLEXPWM3_PWM1_B			(0x094 0x284 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_32_LPUART7_RXD				(0x094 0x284 0x558 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_32_CCM_PMIC_READY			(0x094 0x284 0x3FC 0x3 0x4)
#define MXRT1050_IOMUXC_GPIO_EMC_32_CSI_DATA21				(0x094 0x284 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_32_GPIO3_IO18				(0x094 0x284 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_33_SEMC_DA11				(0x098 0x288 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_33_FLEXPWM3_PWM2_A			(0x098 0x288 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_33_USDHC1_RESET_B			(0x098 0x288 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_33_SAI3_RX_DATA			(0x098 0x288 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_33_CSI_DATA20				(0x098 0x288 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_33_GPIO3_IO19				(0x098 0x288 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_34_SEMC_DA12				(0x09C 0x28C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_34_FLEXPWM3_PWM2_B			(0x09C 0x28C 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_34_USDHC1_VSELECT			(0x09C 0x28C 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_34_SAI3_RX_SYNC			(0x09C 0x28C 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_34_CSI_DATA19				(0x09C 0x28C 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_34_GPIO3_IO20				(0x09C 0x28C 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_35_SEMC_DA13				(0x0A0 0x290 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_35_XBAR_INOUT18			(0x0A0 0x290 0x630 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_35_GPT1_COMPARE1			(0x0A0 0x290 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_35_SAI3_RX_BCLK			(0x0A0 0x290 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_35_CSI_DATA18				(0x0A0 0x290 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_35_GPIO3_IO21				(0x0A0 0x290 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_35_USDHC1_CD_B				(0x0A0 0x290 0x5D4 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_36_SEMC_DA14				(0x0A4 0x294 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_36_XBAR_INOUT22			(0x0A4 0x294 0x638 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_36_GPT1_COMPARE2			(0x0A4 0x294 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_36_SAI3_TX_DATA			(0x0A4 0x294 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_36_CSI_DATA17				(0x0A4 0x294 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_36_GPIO3_IO22				(0x0A4 0x294 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_36_USDHC1_WP				(0x0A4 0x294 0x5D8 0x6 0x1)

#define MXRT1050_IOMUXC_GPIO_EMC_37_SEMC_DA15				(0x0A8 0x298 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_37_XBAR_INOUT23			(0x0A8 0x298 0x63C 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_37_GPT1_COMPARE3			(0x0A8 0x298 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_37_SAI3_MCLK				(0x0A8 0x298 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_37_CSI_DATA16				(0x0A8 0x298 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_37_GPIO3_IO23				(0x0A8 0x298 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_37_USDHC2_WP				(0x0A8 0x298 0x608 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_38_SEMC_DM01				(0x0AC 0x29C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_38_FLEXPWM1_PWM3_A			(0x0AC 0x29C 0x454 0x1 0x2)
#define MXRT1050_IOMUXC_GPIO_EMC_38_LPUART8_TXD				(0x0AC 0x29C 0x564 0x2 0x2)
#define MXRT1050_IOMUXC_GPIO_EMC_38_SAI3_TX_BCLK			(0x0AC 0x29C 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_38_CSI_FIELD				(0x0AC 0x29C 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_38_GPIO3_IO24				(0x0AC 0x29C 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_38_USDHC2_VSELECT			(0x0AC 0x29C 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_EMC_39_SEMC_DQS				(0x0B0 0x2A0 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_39_FLEXPWM1_PWM3_B			(0x0B0 0x2A0 0x464 0x1 0x2)
#define MXRT1050_IOMUXC_GPIO_EMC_39_LPUART8_RXD				(0x0B0 0x2A0 0x560 0x2 0x2)
#define MXRT1050_IOMUXC_GPIO_EMC_39_SAI3_TX_SYNC			(0x0B0 0x2A0 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_39_WDOG1_B				(0x0B0 0x2A0 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_39_GPIO3_IO25				(0x0B0 0x2A0 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_39_USDHC2_CD_B				(0x0B0 0x2A0 0x5E0 0x6 0x1)

#define MXRT1050_IOMUXC_GPIO_EMC_40_SEMC_RDY				(0x0B4 0x2A4 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_40_GPT2_CAPTURE2			(0x0B4 0x2A4 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_40_LPSPI1_PCS2				(0x0B4 0x2A4 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_40_USB_OTG2_OC				(0x0B4 0x2A4 0x5CC 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_40_ENET_MDC				(0x0B4 0x2A4 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_40_GPIO3_IO26				(0x0B4 0x2A4 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_40_USDHC2_RESET_B			(0x0B4 0x2A4 0x000 0x6 0x0)

