Mr-Bossman/linux/include/dt-bindings/pinctrl/pins-imxrt1050.h
#define MXRT1050_IOMUXC_GPIO_EMC_41_SEMC_CSX0				(0x0B8 0x2A8 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_41_GPT2_CAPTURE1			(0x0B8 0x2A8 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_41_LPSPI1_PCS3				(0x0B8 0x2A8 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_41_USB_OTG2_PWR			(0x0B8 0x2A8 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_41_ENET_MDIO				(0x0B8 0x2A8 0x430 0x4 0x1)
#define MXRT1050_IOMUXC_GPIO_EMC_41_GPIO3_IO27				(0x0B8 0x2A8 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_EMC_41_USDHC2_VSELECT			(0x0B8 0x2A8 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B0_00_FLEXPWM2_PWM3_A			(0x0BC 0x2AC 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_00_XBAR_INOUT14			(0x0BC 0x2AC 0x644 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_00_REF_CLK_32K			(0x0BC 0x2AC 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_00_USB_OTG2_ID			(0x0BC 0x2AC 0x3F8 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_00_LPI2C1_SCLS			(0x0BC 0x2AC 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_00_GPIO1_IO00			(0x0BC 0x2AC 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_00_USDHC1_RESET_B			(0x0BC 0x2AC 0x000 0x6 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_00_LPSPI3_SCK			(0x0BC 0x2AC 0x510 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B0_01_FLEXPWM2_PWM3_B			(0x0C0 0x2B0 0x484 0x0 0x2)
#define MXRT1050_IOMUXC_GPIO_AD_B0_01_XBAR_INOUT15			(0x0C0 0x2B0 0x648 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_01_REF_CLK_24M			(0x0C0 0x2B0 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_01_USB_OTG1_ID			(0x0C0 0x2B0 0x3F4 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_01_LPI2C1_SDAS			(0x0C0 0x2B0 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_01_GPIO1_IO01			(0x0C0 0x2B0 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_01_EWM_OUT_B				(0x0C0 0x2B0 0x000 0x6 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_01_LPSPI3_SDO			(0x0C0 0x2B0 0x518 0x7 0x1)

#define MXRT1050_IOMUXC_GPIO_AD_B0_02_FLEXCAN2_TX			(0x0C4 0x2B4 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_02_XBAR_INOUT16			(0x0C4 0x2B4 0x64C 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_02_LPUART6_TXD			(0x0C4 0x2B4 0x554 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_02_USB_OTG1_PWR			(0x0C4 0x2B4 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_02_FLEXPWM1_PWM0_X			(0x0C4 0x2B4 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_02_GPIO1_IO02			(0x0C4 0x2B4 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_02_LPI2C1_HREQ			(0x0C4 0x2B4 0x000 0x6 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_02_LPSPI3_SDI			(0x0C4 0x2B4 0x514 0x7 0x1)

#define MXRT1050_IOMUXC_GPIO_AD_B0_03_FLEXCAN2_RX			(0x0C8 0x2B8 0x450 0x0 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_03_XBAR_INOUT17			(0x0C8 0x2B8 0x62C 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_03_LPUART6_RXD			(0x0C8 0x2B8 0x550 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_03_USB_OTG1_OC			(0x0C8 0x2B8 0x5D0 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_03_FLEXPWM1_PWM1_X			(0x0C8 0x2B8 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_03_GPIO1_IO03			(0x0C8 0x2B8 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_03_REF_CLK_24M			(0x0C8 0x2B8 0x000 0x6 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_03_LPSPI3_PCS0			(0x0C8 0x2B8 0x50C 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B0_04_SRC_BOOT_MODE00			(0x0CC 0x2BC 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_04_MQS_RIGHT				(0x0CC 0x2BC 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_04_ENET_TX_DATA03			(0x0CC 0x2BC 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_04_SAI2_TX_SYNC			(0x0CC 0x2BC 0x5C4 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_04_CSI_DATA09			(0x0CC 0x2BC 0x41C 0x4 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_04_GPIO1_IO04			(0x0CC 0x2BC 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_04_PIT_TRIGGER00			(0x0CC 0x2BC 0x000 0x6 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_04_LPSPI3_PCS1			(0x0CC 0x2BC 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B0_05_SRC_BOOT_MODE01			(0x0D0 0x2C0 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_05_MQS_LEFT				(0x0D0 0x2C0 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_05_ENET_TX_DATA02			(0x0D0 0x2C0 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_05_SAI2_TX_BCLK			(0x0D0 0x2C0 0x5C0 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_05_CSI_DATA08			(0x0D0 0x2C0 0x418 0x4 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_05_GPIO1_IO05			(0x0D0 0x2C0 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_05_XBAR_INOUT17			(0x0D0 0x2C0 0x62C 0x6 0x2)
#define MXRT1050_IOMUXC_GPIO_AD_B0_05_LPSPI3_PCS2			(0x0D0 0x2C0 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B0_06_JTAG_TMS				(0x0D4 0x2C4 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_06_GPT2_COMPARE1			(0x0D4 0x2C4 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_06_ENET_RX_CLK			(0x0D4 0x2C4 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_06_SAI2_RX_BCLK			(0x0D4 0x2C4 0x5B4 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_06_CSI_DATA07			(0x0D4 0x2C4 0x414 0x4 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_06_GPIO1_IO06			(0x0D4 0x2C4 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_06_XBAR_INOUT18			(0x0D4 0x2C4 0x630 0x6 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_06_LPSPI3_PCS3			(0x0D4 0x2C4 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B0_07_JTAG_TCK				(0x0D8 0x2C8 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_GPT2_COMPARE2			(0x0D8 0x2C8 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_ENET_TX_ER			(0x0D8 0x2C8 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_SAI2_RX_SYNC			(0x0D8 0x2C8 0x5BC 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_CSI_DATA06			(0x0D8 0x2C8 0x410 0x4 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_GPIO1_IO07			(0x0D8 0x2C8 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_XBAR_INOUT19			(0x0D8 0x2C8 0x654 0x6 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_ENET_1588_EVENT3_OUT		(0x0D8 0x2C8 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B0_08_JTAG_MOD				(0x0DC 0x2CC 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_08_GPT2_COMPARE3			(0x0DC 0x2CC 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_08_ENET_RX_DATA03			(0x0DC 0x2CC 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_08_SAI2_RX_DATA			(0x0DC 0x2CC 0x5B8 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_08_CSI_DATA05			(0x0DC 0x2CC 0x40C 0x4 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_08_GPIO1_IO08			(0x0DC 0x2CC 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_08_XBAR_INOUT20			(0x0DC 0x2CC 0x634 0x6 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_08_ENET_1588_EVENT3_IN		(0x0DC 0x2CC 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B0_09_JTAG_TDI				(0x0E0 0x2D0 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_09_FLEXPWM2_PWM3_A			(0x0E0 0x2D0 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_09_ENET_RX_DATA02			(0x0E0 0x2D0 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_09_SAI2_TX_DATA			(0x0E0 0x2D0 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_09_CSI_DATA04			(0x0E0 0x2D0 0x408 0x4 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_09_GPIO1_IO09			(0x0E0 0x2D0 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_09_XBAR_INOUT21			(0x0E0 0x2D0 0x658 0x6 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_09_GPT2_CLK				(0x0E0 0x2D0 0x000 0x7 0x0)

