Mr-Bossman/linux/include/dt-bindings/pinctrl/pins-imxrt1050.h
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_JTAG_TDO				(0x0E4 0x2D4 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_FLEXPWM1_PWM3_A			(0x0E4 0x2D4 0x454 0x1 0x3)
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_ENET_CRS				(0x0E4 0x2D4 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_SAI2_MCLK				(0x0E4 0x2D4 0x5B0 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_CSI_DATA03			(0x0E4 0x2D4 0x404 0x4 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_GPIO1_IO10			(0x0E4 0x2D4 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_XBAR_INOUT22			(0x0E4 0x2D4 0x638 0x6 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_ENET_1588_EVENT0_OUT		(0x0E4 0x2D4 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B0_11_JTAG_TRSTB			(0x0E8 0x2D8 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_11_FLEXPWM1_PWM3_B			(0x0E8 0x2D8 0x464 0x1 0x3)
#define MXRT1050_IOMUXC_GPIO_AD_B0_11_ENET_COL				(0x0E8 0x2D8 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_11_WDOG1_B				(0x0E8 0x2D8 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_11_CSI_DATA02			(0x0E8 0x2D8 0x400 0x4 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_11_GPIO1_IO11			(0x0E8 0x2D8 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_11_XBAR_INOUT23			(0x0E8 0x2D8 0x63C 0x6 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_11_ENET_1588_EVENT0_IN		(0x0E8 0x2D8 0x444 0x7 0x1)

#define MXRT1050_IOMUXC_GPIO_AD_B0_12_LPI2C4_SCL			(0x0EC 0x2DC 0x4E4 0x0 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_12_CCM_PMIC_READY			(0x0EC 0x2DC 0x3FC 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_12_LPUART1_TXD			(0x0EC 0x2DC 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_12_WDOG2_B				(0x0EC 0x2DC 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_12_FLEXPWM1_PWM2_X			(0x0EC 0x2DC 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_12_GPIO1_IO12			(0x0EC 0x2DC 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_12_ENET_1588_EVENT1_OUT		(0x0EC 0x2DC 0x000 0x6 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_12_NMI				(0x0EC 0x2DC 0x568 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B0_13_LPI2C4_SDA			(0x0F0 0x2E0 0x4E8 0x0 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_13_GPT1_CLK				(0x0F0 0x2E0 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_13_LPUART1_RXD			(0x0F0 0x2E0 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_13_EWM_OUT_B				(0x0F0 0x2E0 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_13_FLEXPWM1_PWM3_X			(0x0F0 0x2E0 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_13_GPIO1_IO13			(0x0F0 0x2E0 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_13_ENET_1588_EVENT1_IN		(0x0F0 0x2E0 0x000 0x6 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_13_REF_CLK_24M			(0x0F0 0x2E0 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B0_14_USB_OTG2_OC			(0x0F4 0x2E4 0x5CC 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_14_XBAR_INOUT24			(0x0F4 0x2E4 0x640 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B0_14_LPUART1_CTS_B			(0x0F4 0x2E4 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_14_ENET_1588_EVENT0_OUT		(0x0F4 0x2E4 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_14_CSI_VSYNC				(0x0F4 0x2E4 0x428 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_14_GPIO1_IO14			(0x0F4 0x2E4 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_14_FLEXCAN2_TX			(0x0F4 0x2E4 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B0_15_USB_OTG2_PWR			(0x0F8 0x2E8 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_15_XBAR_INOUT25			(0x0F8 0x2E8 0x650 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_15_LPUART1_RTS_B			(0x0F8 0x2E8 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_15_ENET_1588_EVENT0_IN		(0x0F8 0x2E8 0x444 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_15_CSI_HSYNC				(0x0F8 0x2E8 0x420 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_15_GPIO1_IO15			(0x0F8 0x2E8 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B0_15_FLEXCAN2_RX			(0x0F8 0x2E8 0x450 0x6 0x2)
#define MXRT1050_IOMUXC_GPIO_AD_B0_15_WDOG1_WDOG_RST_B_DEB		(0x0F8 0x2E8 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B1_00_USB_OTG2_ID			(0x0FC 0x2EC 0x3F8 0x0 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_00_TMR3_TIMER0			(0x0FC 0x2EC 0x57C 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_00_LPUART2_CTS_B			(0x0FC 0x2EC 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL			(0x0FC 0x2EC 0x4CC 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_00_WDOG1_B				(0x0FC 0x2EC 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_00_GPIO1_IO16			(0x0FC 0x2EC 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_00_USDHC1_WP				(0x0FC 0x2EC 0x5D8 0x6 0x2)
#define MXRT1050_IOMUXC_GPIO_AD_B1_00_KPP_ROW07				(0x0FC 0x2EC 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B1_01_USB_OTG1_PWR			(0x100 0x2F0 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_01_TMR3_TIMER1			(0x100 0x2F0 0x580 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_01_LPUART2_RTS_B			(0x100 0x2F0 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA			(0x100 0x2F0 0x4D0 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_01_CCM_PMIC_READY			(0x100 0x2F0 0x3FC 0x4 0x2)
#define MXRT1050_IOMUXC_GPIO_AD_B1_01_GPIO1_IO17			(0x100 0x2F0 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_01_USDHC1_VSELECT			(0x100 0x2F0 0x000 0x6 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_01_KPP_COL07				(0x100 0x2F0 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B1_02_USB_OTG1_ID			(0x104 0x2F4 0x3F4 0x0 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_02_TMR3_TIMER2			(0x104 0x2F4 0x584 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_02_LPUART2_TXD			(0x104 0x2F4 0x530 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_02_SPDIF_OUT				(0x104 0x2F4 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_02_ENET_1588_EVENT2_OUT		(0x104 0x2F4 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_02_GPIO1_IO18			(0x104 0x2F4 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_02_USDHC1_CD_B			(0x104 0x2F4 0x5D4 0x6 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_02_KPP_ROW06				(0x104 0x2F4 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B1_03_USB_OTG1_OC			(0x108 0x2F8 0x5D0 0x0 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_03_TMR3_TIMER3			(0x108 0x2F8 0x588 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_03_LPUART2_RXD			(0x108 0x2F8 0x52C 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_03_SPDIF_IN				(0x108 0x2F8 0x5C8 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_03_ENET_1588_EVENT2_IN		(0x108 0x2F8 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_03_GPIO1_IO19			(0x108 0x2F8 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_03_USDHC2_CD_B			(0x108 0x2F8 0x5E0 0x6 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_03_KPP_COL06				(0x108 0x2F8 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B1_04_FLEXSPI_B_DATA3			(0x10C 0x2FC 0x4C4 0x0 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_ENET_MDC				(0x10C 0x2FC 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_LPUART3_CTS_B			(0x10C 0x2FC 0x534 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_SPDIF_SR_CLK			(0x10C 0x2FC 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_CSI_PIXCLK			(0x10C 0x2FC 0x424 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_GPIO1_IO20			(0x10C 0x2FC 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_USDHC2_DATA0			(0x10C 0x2FC 0x5E8 0x6 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_KPP_ROW05				(0x10C 0x2FC 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B1_05_FLEXSPI_B_DATA2			(0x110 0x300 0x4C0 0x0 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_05_ENET_MDIO				(0x110 0x300 0x430 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_05_LPUART3_RTS_B			(0x110 0x300 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_05_SPDIF_OUT				(0x110 0x300 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_05_CSI_MCLK				(0x110 0x300 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_05_GPIO1_IO21			(0x110 0x300 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_05_USDHC2_DATA1			(0x110 0x300 0x5EC 0x6 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_05_KPP_COL05				(0x110 0x300 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B1_06_FLEXSPI_B_DATA1			(0x114 0x304 0x4BC 0x0 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_06_LPI2C3_SDA			(0x114 0x304 0x4E0 0x1 0x2)
#define MXRT1050_IOMUXC_GPIO_AD_B1_06_LPUART3_TXD			(0x114 0x304 0x53C 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_06_SPDIF_LOCK			(0x114 0x304 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_06_CSI_VSYNC				(0x114 0x304 0x428 0x4 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_06_GPIO1_IO22			(0x114 0x304 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_06_USDHC2_DATA2			(0x114 0x304 0x5F0 0x6 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_06_KPP_ROW04				(0x114 0x304 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B1_07_FLEXSPI_B_DATA0			(0x118 0x308 0x4B8 0x0 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_07_LPI2C3_SCL			(0x118 0x308 0x4DC 0x1 0x2)
#define MXRT1050_IOMUXC_GPIO_AD_B1_07_LPUART3_RXD			(0x118 0x308 0x538 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_07_SPDIF_EXT_CLK			(0x118 0x308 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_07_CSI_HSYNC				(0x118 0x308 0x420 0x4 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_07_GPIO1_IO23			(0x118 0x308 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_07_USDHC2_DATA3			(0x118 0x308 0x5F4 0x6 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_07_KPP_COL04				(0x118 0x308 0x000 0x7 0x0)

#define MXRT1050_IOMUXC_GPIO_AD_B1_08_FLEXSPI_A_SS1_B			(0x11C 0x30C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_08_FLEXPWM4_PWM0_A			(0x11C 0x30C 0x494 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_08_FLEXCAN1_TX			(0x11C 0x30C 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_08_CCM_PMIC_READY			(0x11C 0x30C 0x3FC 0x3 0x3)
#define MXRT1050_IOMUXC_GPIO_AD_B1_08_CSI_DATA09			(0x11C 0x30C 0x41C 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_08_GPIO1_IO24			(0x11C 0x30C 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_AD_B1_08_USDHC2_CMD			(0x11C 0x30C 0x5E4 0x6 0x1)
#define MXRT1050_IOMUXC_GPIO_AD_B1_08_KPP_ROW03				(0x11C 0x30C 0x000 0x7 0x0)

