Mr-Bossman/linux/include/dt-bindings/pinctrl/pins-imxrt1050.h
#define MXRT1050_IOMUXC_GPIO_B0_03_LCD_VSYNC				(0x148 0x338 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_03_TMR2_TIMER0				(0x148 0x338 0x56C 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_B0_03_FLEXCAN1_RX				(0x148 0x338 0x44C 0x2 0x3)
#define MXRT1050_IOMUXC_GPIO_B0_03_LPSPI4_SCK				(0x148 0x338 0x520 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_03_FLEXIO2_D03				(0x148 0x338 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_03_GPIO2_IO03				(0x148 0x338 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_03_WDOG2_RESET_B_DEB			(0x148 0x338 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_B0_04_LCD_DATA00				(0x14C 0x33C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_04_TMR2_TIMER1				(0x14C 0x33C 0x570 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_B0_04_LPI2C2_SCL				(0x14C 0x33C 0x4D4 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_B0_04_ARM_TRACE00				(0x14C 0x33C 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_04_FLEXIO2_D04				(0x14C 0x33C 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_04_GPIO2_IO04				(0x14C 0x33C 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_04_SRC_BT_CFG00				(0x14C 0x33C 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_B0_05_LCD_DATA01				(0x150 0x340 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_05_TMR2_TIMER2				(0x150 0x340 0x574 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_B0_05_LPI2C2_SDA				(0x150 0x340 0x4D8 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_B0_05_ARM_TRACE01				(0x150 0x340 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_05_FLEXIO2_D05				(0x150 0x340 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_05_GPIO2_IO05				(0x150 0x340 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_05_SRC_BT_CFG01				(0x150 0x340 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_B0_06_LCD_DATA02				(0x154 0x344 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_06_TMR3_TIMER0				(0x154 0x344 0x57C 0x1 0x2)
#define MXRT1050_IOMUXC_GPIO_B0_06_FLEXPWM2_PWM0_A			(0x154 0x344 0x478 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_B0_06_ARM_TRACE02				(0x154 0x344 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_06_FLEXIO2_D06				(0x154 0x344 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_06_GPIO2_IO06				(0x154 0x344 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_06_SRC_BT_CFG02				(0x154 0x344 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_B0_07_LCD_DATA03				(0x158 0x348 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_07_TMR3_TIMER1				(0x158 0x348 0x580 0x1 0x2)
#define MXRT1050_IOMUXC_GPIO_B0_07_FLEXPWM2_PWM0_B			(0x158 0x348 0x488 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_B0_07_ARM_TRACE03				(0x158 0x348 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_07_FLEXIO2_D07				(0x158 0x348 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_07_GPIO2_IO07				(0x158 0x348 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_07_SRC_BT_CFG03				(0x158 0x348 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_B0_08_LCD_DATA04				(0x15C 0x34C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_08_TMR3_TIMER2				(0x15C 0x34C 0x584 0x1 0x2)
#define MXRT1050_IOMUXC_GPIO_B0_08_FLEXPWM2_PWM1_A			(0x15C 0x34C 0x47C 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_B0_08_LPUART3_TXD				(0x15C 0x34C 0x53C 0x3 0x2)
#define MXRT1050_IOMUXC_GPIO_B0_08_FLEXIO2_D08				(0x15C 0x34C 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_08_GPIO2_IO08				(0x15C 0x34C 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_08_SRC_BT_CFG04				(0x15C 0x34C 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_B0_09_LCD_DATA05				(0x160 0x350 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_09_TMR4_TIMER0				(0x160 0x350 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_09_FLEXPWM2_PWM1_B			(0x160 0x350 0x48C 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_B0_09_LPUART3_RXD				(0x160 0x350 0x538 0x3 0x2)
#define MXRT1050_IOMUXC_GPIO_B0_09_FLEXIO2_D09				(0x160 0x350 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_09_GPIO2_IO09				(0x160 0x350 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_09_SRC_BT_CFG05				(0x160 0x350 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_B0_10_LCD_DATA06				(0x164 0x354 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_10_TMR4_TIMER1				(0x164 0x354 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_10_FLEXPWM2_PWM2_A			(0x164 0x354 0x480 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_B0_10_SAI1_TX_DATA03			(0x164 0x354 0x598 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_B0_10_FLEXIO2_D10				(0x164 0x354 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_10_GPIO2_IO10				(0x164 0x354 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_10_SRC_BT_CFG06				(0x164 0x354 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_B0_11_LCD_DATA07				(0x168 0x358 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_11_TMR4_TIMER2				(0x168 0x358 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_11_FLEXPWM2_PWM2_B			(0x168 0x358 0x490 0x2 0x1)
#define MXRT1050_IOMUXC_GPIO_B0_11_SAI1_TX_DATA02			(0x168 0x358 0x59C 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_B0_11_FLEXIO2_D11				(0x168 0x358 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_11_GPIO2_IO11				(0x168 0x358 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_11_SRC_BT_CFG07				(0x168 0x358 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_B0_12_LCD_DATA08				(0x16C 0x35C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_12_XBAR_INOUT10				(0x16C 0x35C 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_12_ARM_TRACE_CLK			(0x16C 0x35C 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_12_SAI1_TX_DATA01			(0x16C 0x35C 0x5A0 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_B0_12_FLEXIO2_D12				(0x16C 0x35C 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_12_GPIO2_IO12				(0x16C 0x35C 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_12_SRC_BT_CFG08				(0x16C 0x35C 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_B0_13_LCD_DATA09				(0x170 0x360 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_13_XBAR_INOUT11				(0x170 0x360 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_13_ARM_TRACE_SWO			(0x170 0x360 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_13_SAI1_MCLK				(0x170 0x360 0x58C 0x3 0x2)
#define MXRT1050_IOMUXC_GPIO_B0_13_FLEXIO2_D13				(0x170 0x360 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_13_GPIO2_IO13				(0x170 0x360 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_13_SRC_BT_CFG09				(0x170 0x360 0x000 0x6 0x0)

