Mr-Bossman/linux/include/dt-bindings/pinctrl/pins-imxrt1050.h
#define MXRT1050_IOMUXC_GPIO_B0_14_LCD_DATA10				(0x174 0x364 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_14_XBAR_INOUT12				(0x174 0x364 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_14_ARM_CM7_TXEV				(0x174 0x364 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_14_SAI1_RX_SYNC				(0x174 0x364 0x5A4 0x3 0x2)
#define MXRT1050_IOMUXC_GPIO_B0_14_FLEXIO2_D14				(0x174 0x364 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_14_GPIO2_IO14				(0x174 0x364 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_14_SRC_BT_CFG10				(0x174 0x364 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_B0_15_LCD_DATA11				(0x178 0x368 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_15_XBAR_INOUT13				(0x178 0x368 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_15_ARM_CM7_RXEV				(0x178 0x368 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_15_SAI1_RX_BCLK				(0x178 0x368 0x590 0x3 0x2)
#define MXRT1050_IOMUXC_GPIO_B0_15_FLEXIO2_D15				(0x178 0x368 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_15_GPIO2_IO15				(0x178 0x368 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B0_15_SRC_BT_CFG11				(0x178 0x368 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_B1_00_LCD_DATA12				(0x17C 0x36C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_00_XBAR_INOUT14				(0x17C 0x36C 0x644 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_B1_00_LPUART4_TXD				(0x17C 0x36C 0x544 0x2 0x2)
#define MXRT1050_IOMUXC_GPIO_B1_00_SAI1_RX_DATA00			(0x17C 0x36C 0x594 0x3 0x2)
#define MXRT1050_IOMUXC_GPIO_B1_00_FLEXIO2_D16				(0x17C 0x36C 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_00_GPIO2_IO16				(0x17C 0x36C 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_00_FLEXPWM1_PWM3_A			(0x17C 0x36C 0x454 0x6 0x4)

#define MXRT1050_IOMUXC_GPIO_B1_01_LCD_DATA13				(0x180 0x370 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_01_XBAR_INOUT15				(0x180 0x370 0x648 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_B1_01_LPUART4_RXD				(0x180 0x370 0x540 0x2 0x2)
#define MXRT1050_IOMUXC_GPIO_B1_01_SAI1_TX_DATA00			(0x180 0x370 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_01_FLEXIO2_D17				(0x180 0x370 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_01_GPIO2_IO17				(0x180 0x370 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_01_FLEXPWM1_PWM3_B			(0x180 0x370 0x464 0x6 0x4)

#define MXRT1050_IOMUXC_GPIO_B1_02_LCD_DATA14				(0x184 0x374 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_02_XBAR_INOUT16				(0x184 0x374 0x64C 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_B1_02_LPSPI4_PCS2				(0x184 0x374 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_02_SAI1_TX_BCLK				(0x184 0x374 0x5A8 0x3 0x2)
#define MXRT1050_IOMUXC_GPIO_B1_02_FLEXIO2_D18				(0x184 0x374 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_02_GPIO2_IO18				(0x184 0x374 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_02_FLEXPWM2_PWM3_A			(0x184 0x374 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_B1_03_LCD_DATA15				(0x188 0x378 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_03_XBAR_INOUT17				(0x188 0x378 0x62C 0x1 0x3)
#define MXRT1050_IOMUXC_GPIO_B1_03_LPSPI4_PCS1				(0x188 0x378 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_03_SAI1_TX_SYNC				(0x188 0x378 0x5AC 0x3 0x2)
#define MXRT1050_IOMUXC_GPIO_B1_03_FLEXIO2_D19				(0x188 0x378 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_03_GPIO2_IO19				(0x188 0x378 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_03_FLEXPWM2_PWM3_B			(0x188 0x378 0x484 0x6 0x3)

#define MXRT1050_IOMUXC_GPIO_B1_04_LCD_DATA16				(0x18C 0x37C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_04_LPSPI4_PCS0				(0x18C 0x37C 0x51C 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_B1_04_CSI_DATA15				(0x18C 0x37C 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_04_ENET_RX_DATA00			(0x18C 0x37C 0x434 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_B1_04_FLEXIO2_D20				(0x18C 0x37C 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_04_GPIO2_IO20				(0x18C 0x37C 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_B1_05_LCD_DATA17				(0x190 0x380 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_05_LPSPI4_SDI				(0x190 0x380 0x524 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_B1_05_CSI_DATA14				(0x190 0x380 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_05_ENET_RX_DATA01			(0x190 0x380 0x438 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_B1_05_FLEXIO2_D21				(0x190 0x380 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_05_GPIO2_IO21				(0x190 0x380 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_B1_06_LCD_DATA18				(0x194 0x384 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_06_LPSPI4_SDO				(0x194 0x384 0x528 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_B1_06_CSI_DATA13				(0x194 0x384 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_06_ENET_RX_EN				(0x194 0x384 0x43C 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_B1_06_FLEXIO2_D22				(0x194 0x384 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_06_GPIO2_IO22				(0x194 0x384 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_B1_07_LCD_DATA19				(0x198 0x388 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_07_LPSPI4_SCK				(0x198 0x388 0x520 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_B1_07_CSI_DATA12				(0x198 0x388 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_07_ENET_TX_DATA00			(0x198 0x388 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_07_FLEXIO2_D23				(0x198 0x388 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_07_GPIO2_IO23				(0x198 0x388 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_B1_08_LCD_DATA20				(0x19C 0x38C 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_08_TMR1_TIMER3				(0x19C 0x38C 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_08_CSI_DATA11				(0x19C 0x38C 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_08_ENET_TX_DATA01			(0x19C 0x38C 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_08_FLEXIO2_D24				(0x19C 0x38C 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_08_GPIO2_IO24				(0x19C 0x38C 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_08_FLEXCAN2_TX				(0x19C 0x38C 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_B1_09_LCD_DATA21				(0x1A0 0x390 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_09_TMR2_TIMER3				(0x1A0 0x390 0x578 0x1 0x1)
#define MXRT1050_IOMUXC_GPIO_B1_09_CSI_DATA10				(0x1A0 0x390 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_09_ENET_TX_EN				(0x1A0 0x390 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_09_FLEXIO2_D25				(0x1A0 0x390 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_09_GPIO2_IO25				(0x1A0 0x390 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_09_FLEXCAN2_RX				(0x1A0 0x390 0x450 0x6 0x3)

#define MXRT1050_IOMUXC_GPIO_B1_10_LCD_DATA22				(0x1A4 0x394 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_10_TMR3_TIMER3				(0x1A4 0x394 0x588 0x1 0x2)
#define MXRT1050_IOMUXC_GPIO_B1_10_CSI_DATA00				(0x1A4 0x394 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_10_ENET_TX_CLK				(0x1A4 0x394 0x448 0x3 0x1)
#define MXRT1050_IOMUXC_GPIO_B1_10_FLEXIO2_D26				(0x1A4 0x394 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_10_GPIO2_IO26				(0x1A4 0x394 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_B1_10_ENET_REF_CLK				(0x1A4 0x394 0x42C 0x6 0x1)

