Mr-Bossman/linux/include/dt-bindings/pinctrl/pins-imxrt1050.h
#define MXRT1050_IOMUXC_GPIO_SD_B1_05_USDHC2_CMD			(0x1E8 0x3D8 0x5E4 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_05_FLEXSPI_A_DQS			(0x1E8 0x3D8 0x4A4 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_05_LPI2C1_SDA			(0x1E8 0x3D8 0x4D0 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_05_SAI1_RX_BCLK			(0x1E8 0x3D8 0x590 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_05_FLEXCAN1_B_SS0_B			(0x1E8 0x3D8 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_05_GPIO3_IO05			(0x1E8 0x3D8 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_SD_B1_06_USDHC2_RESET_B			(0x1EC 0x3DC 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_06_FLEXSPI_A_SS0_B			(0x1EC 0x3DC 0x000 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_06_LPUART7_CTS_B			(0x1EC 0x3DC 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_06_SAI1_RX_DATA00			(0x1EC 0x3DC 0x594 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_06_LPSPI2_PCS0			(0x1EC 0x3DC 0x4FC 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_06_GPIO3_IO06			(0x1EC 0x3DC 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_SD_B1_07_SEMC_CSX1				(0x1F0 0x3E0 0x000 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_07_FLEXSPI_A_SCLK			(0x1F0 0x3E0 0x4C8 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_07_LPUART7_RTS_B			(0x1F0 0x3E0 0x000 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_07_SAI1_TX_DATA00			(0x1F0 0x3E0 0x000 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_07_LPSPI2_SCK			(0x1F0 0x3E0 0x500 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_07_GPIO3_IO07			(0x1F0 0x3E0 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_07_CCM_REF_EN_B			(0x1F0 0x3E0 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_SD_B1_08_USDHC2_DATA4			(0x1F4 0x3E4 0x5F8 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_08_FLEXSPI_A_DATA0			(0x1F4 0x3E4 0x4A8 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_08_LPUART7_TXD			(0x1F4 0x3E4 0x55C 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_08_SAI1_TX_BLCK			(0x1F4 0x3E4 0x5A8 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_08_LPSPI2_SDO			(0x1F4 0x3E4 0x508 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_08_GPIO3_IO08			(0x1F4 0x3E4 0x000 0x5 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_08_SEMC_CSX2				(0x1F4 0x3E4 0x000 0x6 0x0)

#define MXRT1050_IOMUXC_GPIO_SD_B1_09_USDHC2_DATA5			(0x1F8 0x3E8 0x5FC 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_09_FLEXSPI_A_DATA1			(0x1F8 0x3E8 0x4AC 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_09_LPUART7_RXD			(0x1F8 0x3E8 0x558 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_09_SAI1_TX_SYNC			(0x1F8 0x3E8 0x5AC 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_09_LPSPI2_SDI			(0x1F8 0x3E8 0x504 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_09_GPIO3_IO09			(0x1F8 0x3E8 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_SD_B1_10_USDHC2_DATA6			(0x1FC 0x3EC 0x600 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_10_FLEXSPI_A_DATA2			(0x1FC 0x3EC 0x4B0 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_10_LPUART2_RXD			(0x1FC 0x3EC 0x52C 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_10_LPI2C2_SDA			(0x1FC 0x3EC 0x4D8 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_10_LPSPI2_PCS2			(0x1FC 0x3EC 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_10_GPIO3_IO10			(0x1FC 0x3EC 0x000 0x5 0x0)

#define MXRT1050_IOMUXC_GPIO_SD_B1_11_USDHC2_DATA7			(0x200 0x3F0 0x604 0x0 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_11_FLEXSPI_A_DATA3			(0x200 0x3F0 0x4B4 0x1 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_11_LPUART2_TXD			(0x200 0x3F0 0x530 0x2 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_11_LPI2C2_SCL			(0x200 0x3F0 0x4D4 0x3 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_11_LPSPI2_PCS3			(0x200 0x3F0 0x000 0x4 0x0)
#define MXRT1050_IOMUXC_GPIO_SD_B1_11_GPIO3_IO11			(0x200 0x3F0 0x000 0x5 0x0)

#endif /* _DT_BINDINGS_PINCTRL_IMXRT1050_PINFUNC_H */
